run/flowthermal/Project_Hydrocyclone/constant/fvModels
/*--------------------------------*- OpenFOAM -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

concentration  0;

kBouyancyCurvatureSource
{
    type            coded;
    active          yes;
    select          all;

    g               (0 0 -9.81);
    ScT             0.7;


    field          k;

        codeInclude
        #{
            #include "fvm.H"
            #include "fvc.H"
            #include <cmath>

        #};



        codeCorrect
        #{

        #};




        codeAddRhoSup
        #{
     //#############################################BOUYANCY START ##############################################  

             // Get the input data
            dimensionedVector g
            (
                 dimensionedVector(
                     "g",
                     dimAcceleration,
		     coeffs().lookup("g")
                 )
            ); 
            scalar ScT(readScalar(coeffs().lookup("ScT")));

                // Get the required fields
                const volVectorField& U = mesh().lookupObject<volVectorField>("U");
                const volScalarField& nut = mesh().lookupObject<volScalarField>("nut");
                const volScalarField& k    = mesh().lookupObject<volScalarField>("k");
                 const volScalarField& epsilon = mesh().lookupObject<volScalarField>("epsilon");
                const surfaceScalarField& phi = mesh().lookupObject<surfaceScalarField>("phi");
                const volScalarField& alphas = mesh().lookupObject<volScalarField>("alpha.sludge");
                const volScalarField& alphaw = mesh().lookupObject<volScalarField>("alpha.water");
                //const volScalarField& rho = mesh().lookupObject<volScalarField>("rho");
                //const volScalarField& w = mesh().lookupObject<volScalarField>("omega");
                dimensionedScalar rho_small("rho_small", dimMass/dimVolume, SMALL);
                dimensionedScalar k_small("k_small", dimEnergy/dimMass, SMALL);
                dimensionedScalar omega_small("omega_small", dimless/dimTime, SMALL);
               
                // Get cell volume
	            const scalarField& V = mesh().V();
		
                // Compute the source term
                const scalarField Gb = nut.internalField()/(ScT*(rho+rho_small))*(g & fvc::grad(rho))*V;

                //Info<<endl<<endl<<"Source added ="<<Gb<<"hello"<<endl; 


  //#############################################BOUYANCY END ##############################################              



  //#############################################CURVATURE START ##############################################              



        tmp<volTensorField> tgradU = fvc::grad(U); // gradient of velocity field
        tmp<volSymmTensorField> tS = symm(tgradU()); // symmetric part of the gradient (strain rate tensor)
    
        tmp<volTensorField> tOmega = skew(tgradU()); // antisymmetric part of the gradient (vorticity tensor)
         volScalarField w= epsilon/(0.09* k + k_small); // turbulence dissipation rate divided by a small constant times k
       // volScalarField tefomega2 = tefomega * tefomega; // square of tefomega

        volScalarField S2("S2", 2.0 * magSqr(tS())); // square of the strain rate tensor
       
        volScalarField Omega2("Omega2", 2.0 * magSqr(tOmega()));
       
       
       // volScalarField Omega2("Omega2", 2.0 * magSqr(tOmega())); // square of the vorticity tensor
       volScalarField Omegamag = mag(tOmega()); // magnitude of the vorticity tensor

//^^^^^^^^^^^^^^^^^^calculating G^^^^^^^^^^^^^^^^^^^^^^

    const scalarField GbyNu = dev(twoSymm(tgradU())) && tgradU();
   const scalarField G = nut.internalField()*GbyNu*V;
//Info<<"GbyNu"<<endl<<GbyNu[0]<<endl<<endl;
//Info<<"GbyNu"<<endl<<GbyNu[10]<<endl<<endl;
//Info<<"GbyNu"<<endl<<GbyNu[100]<<endl<<endl;
   
//Info<<"nut"<<endl<<nut[0]<<endl<<endl;
//Info<<"nut"<<endl<<nut[10]<<endl<<endl;
//Info<<"nut"<<endl<<nut[100]<<endl<<endl;

    tgradU.clear();

    //const scalarField pkG= min(G, scalar(10.0*0.09)*k.internalField()*w.internalField()*V);

//^^^^^^^^^^^^^^^^^^^^END calculating G^^^^^^^^^^^^^^^^^^^^^^


//^^^^^^^^^^^^^^^^^^^^^^^^^^^^calculating rStar^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 volScalarField rStar
(
    "rStar",
    sqrt(S2) / ((sqrt(Omega2 ))+omega_small) // ratio of the square root of the strain rate tensor squared to the square root of the vorticity tensor squared, ensuring it does not go below a small constant
);
// ratio of the square root of the strain rate tensor squared to the square root of the vorticity tensor squared, ensuring it does not go below a small constant

//^^^^^^^^^^^^^^^^^^^^^^^^^^^^END calculating rStar^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^



//^^^^^^^^^^^^^^^^^^^^^^^^^^^^calculating rTilda^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^

        volScalarField D2("D2", max(S2, 0.09 * sqr(w))); // maximum of the strain rate tensor squared and a small constant times the square of tefomega
        // This is a measure of the turbulence intensity, ensuring it does not go below a certain
        volScalarField Dtilda("Dtilda", pow(sqrt(D2), 3.0) * Omegamag); // cube of the square root of D2 plus a small constant, scaled by the magnitude of the vorticity tensor

        volSymmTensorField DSDt = fvc::ddt(tS())+fvc::div(phi, tS()); // time derivative of the strain rate tensor plus divergence of the flux of the strain rate tensor
       volTensorField DSDtfull("DSDtfull", (tOmega()&tOmega()) * 0.0 ); // full tensor field of the strain rate tensor time derivative



        //volTensorField rTilda= tOmega * 0.0; // Initialize rTilda as a zero tensor field


         forAll(DSDtfull, celli)
        {
           DSDtfull[celli].component(0) = DSDt[celli].component(0);
           DSDtfull[celli].component(1) = DSDt[celli].component(1);
           DSDtfull[celli].component(2) = DSDt[celli].component(2);
           DSDtfull[celli].component(3) = DSDt[celli].component(1);
           DSDtfull[celli].component(4) = DSDt[celli].component(3);
           DSDtfull[celli].component(5) = DSDt[celli].component(4);
           DSDtfull[celli].component(6) = DSDt[celli].component(2);
           DSDtfull[celli].component(7) = DSDt[celli].component(4);
           DSDtfull[celli].component(8) = DSDt[celli].component(5);



        
        }
        // forAll(rTilda, celli)
        // {
            
        //      scalar sum = 0.0;
        //     for (int i = 0; i < 3; ++i)
        //     {
        //         for (int j = 0; j < 3; ++j)
        //         {  
        //             for (int k = 0; k < 3; ++k)
        //             {
                       
        //                         sum += 2.0 * Omega[celli].component(3*i+k)* S[celli].component(3*j+k)*(DSDt[celli].component(3*i+j))/Dtilda[celli]; // Calculate the contribution of each component of the tensors to rTilda
                        
        //             }
        //         }
        //     }

        //     rTilda[celli] = sum;
        // }
 
       // volScalarField rTilda("rTilda", 2.0 * ((tOmega() & tS().T()) && DSDt()) / Dtilda());// Calculate rTilda as a tensor field based on the vorticity tensor, strain rate tensor, and the production term
        volTensorField rt1("rt1", 2.0 * (tOmega() & tS().T() ));// Calculate rTilda as a tensor field based on the vorticity tensor, strain rate tensor, and the production term
        volScalarField rTilda("rTilda", ((rt1 && DSDtfull) / ( Dtilda + dimensionedScalar("Dsmall", dimensionSet(0, 0, -4, 0, 0), SMALL))) ); // Calculate rTilda as a tensor field based on the vorticity tensor, strain rate tensor, and the production term
       // Info<<endl<<endl<<"rTilda ="<<rTilda.dimensions()<<"hello"<<endl; 
        //Info<<endl<<endl<<"rt1 ="<<rt1.dimensions()<<"hello"<<endl; 
        //Info<<endl<<endl<<"DSDTfull ="<<DSDtfull.dimensions()<<"hello"<<endl; 
        //Pout<<endl<<endl<<"Dtilda ="<<Dtilda.dimensions()<<"hello"<<endl; 


     // Info<<endl<<endl<<"alphas ="<<alphas[0]<<"hello"<<endl;
     // Info<<endl<<endl<<"alphas ="<<alphas[10]<<"hello"<<endl;
     // Info<<endl<<endl<<"alphas ="<<alphas[100]<<"hello"<<endl;
       // Info<<endl<<endl<<"alphaw ="<<alphaw<<"hello"<<endl;
        tOmega.clear();
        tS.clear();



        scalar cr1 = 1.0;
        scalar cr2 = 2.0;
        scalar cr3 = 1.0;
        scalar C_curv = 1.0;


        volScalarField frotation =  ((scalar(1.0) + cr1)
                        *(scalar(2.0) * rStar / (scalar(1.0) + rStar+SMALL)))
                         * (scalar(1.0) - cr3 * atan(cr2 * rTilda+SMALL))
                         - cr1;       // Calculate the rotation function based on the strain rate and vorticity tensors


        volScalarField fr1 = max(min(frotation, scalar(1.25)), scalar(0.0)); // Ensure the rotation function is within the range [0, 1.25]
//Info<<"fr1"<<endl<<fr1[0]<<endl<<endl;
//Info<<"fr1"<<endl<<fr1[10]<<endl<<endl;
//Info<<"fr1"<<endl<<fr1[100]<<endl<<endl;



        volScalarField fr2 = max(scalar(0.0), scalar(1.0)+ C_curv*(fr1-scalar(1.0))); // Calculate the curvature correction factor based on the rotation function and a curvature constant
/*
    Info<<"fr2"<<endl<<fr2[0]<<endl<<endl;
    Info<<"fr2"<<endl<<fr2[10]<<endl<<endl;
    Info<<"fr2"<<endl<<fr2[100]<<endl<<endl;

        
Info<<"G"<<endl<<G[0]<<endl<<endl;
    Info<<"G"<<endl<<G[10]<<endl<<endl;
    Info<<"G"<<endl<<G[100]<<endl<<endl;
      




Info<<"pkG"<<endl<<pkG[0]<<endl<<endl;
    Info<<"pkG"<<endl<<pkG[10]<<endl<<endl;
    Info<<"pkG"<<pkG[100]<<endl<<endl;
   */   

/*              // Add the source term to the equation
             scalarField& kSource = eqn.source();
             kSource += Gb + (fr2 - 1.0) * alpha()*rho()*G;;
             
             Info<<"Source added ="<<endl<<endl;  */
             // Add the source term to the equation
            scalarField& kSource = eqn.source();
            kSource += Gb;
            kSource += (fr2 - 1.0) *rho()*G;

        #};

        codeSetValue
        #{
        
        #};

        // Dummy entry. Make dependent on above to trigger recompilation
        code
        #{
            $codeInclude
            $codeCorrect
            $codeAddRhoSup
            $codeSetValue
        #};
    //}
}
epsilonBouyancySource
{
    type            coded;
    active          yes;
    select          all;

    //name            epsilonBuoyancySource;
    g               (0 0 -9.81);
    ScT             0.7;

    //scalarCodedSourceCoeffs
    //{
       // selectionMode   all;

        field          epsilon;

        codeInclude
        #{
             #include "fvm.H"
        #};

        codeCorrect
        #{

        #};

        codeAddSup
        #{
             // Get the input data
             dimensionedVector g
             (
                 dimensionedVector(
                     "g",
                     dimAcceleration,
		     coeffs().lookup("g")
                 )
             ); 
             scalar ScT(readScalar(coeffs().lookup("ScT")));
	     scalar C1 = 0.4;
	     scalar C3 = 0.9;
	     dimensionedScalar k_small("k_small", dimEnergy/dimMass, SMALL);

             // Get the required fields
             const volScalarField& density = mesh().lookupObject<volScalarField>("rho");
             const volScalarField& nut = mesh().lookupObject<volScalarField>("nut");
             const volScalarField& k = mesh().lookupObject<volScalarField>("k");
             const volScalarField& epsilon = mesh().lookupObject<volScalarField>("epsilon");

             // Compute the buoyancy term
             const volScalarField Gb = nut/ScT*(g & fvc::grad(density));

             // Add the source term to the equation
             scalarField& epsilonSource = eqn.source();
             epsilonSource -= C1*epsilon/(k + k_small)*C3*Gb;
        #};

        codeSetValue
        #{
        
        #};

        // Dummy entry. Make dependent on above to trigger recompilation
        code
        #{
            $codeInclude
            $codeCorrect
            $codeAddSup
            $codeSetValue
        #};
    //}
}

/*--------------------------------*- C++ -*----------------------------------*\
|     fvModels to inject curvature correction into k and epsilon             |
\*---------------------------------------------------------------------------*/

/*kCurvatureCorrectionSource
{
    type            coded;
    active          yes;

    select           all;
    field            k;

    //name            kCurvatureCorrectionSource;



    codeInclude
    #{
        #include "fvm.H"
        #include "fvc.H"
        #include <cmath>
       // #include "createTime.H"
        //#include "createMesh.H"
                    int eps(int i, int j, int k)
    {
            if ((i == 0 && j == 1 && k == 2) ||
                (i == 1 && j == 2 && k == 0) ||
                (i == 2 && j == 0 && k == 1)) return double(1);

            if ((i == 2 && j == 1 && k == 0) ||
                (i == 1 && j == 0 && k == 2) ||
                (i == 0 && j == 2 && k == 1)) return double(-1);

            return double(0);
    }

    #};

    codeCorrect
    #{

    #};

    codeAddSup
    #{
        const volVectorField& U = mesh().lookupObject<volVectorField>("U");
        const volScalarField& nut = mesh().lookupObject<volScalarField>("nut");
        const volScalarField& k    = mesh().lookupObject<volScalarField>("k");
        const volScalarField& epsilon = mesh().lookupObject<volScalarField>("epsilon");
        const surfaceScalarField& phi = mesh().lookupObject<surfaceScalarField>("phi");
        const volScalarField& alpha = mesh().lookupObject<volScalarField>("alpha");
        const volScalarField& rho = mesh().lookupObject<volScalarField>("rho");




        volTensorField gradU = fvc::grad(U);
        volSymmTensorField S = symm(gradU);
        //volTensorField Omega = 0.5 * (gradU - gradU.T());
        volTensorField Omega = skew(gradU);
        volScalarField tefomega = epsilon/(0.09* k + SMALL);
        volScalarField tefomega2 = tefomega * tefomega;




        dimensionedVector OmegaRot("OmegaRot", dimless/dimTime, vector(double(0.0),double(0.0),double(0.0))); 
       

        tensor skewOmegaRot = tensor::zero; //2 * Foam::fvc::curl(OmegaRot);  // antisymmetric tensor

        for (int j = 0; j < 3; ++j)
        {
            for (int n = 0; n < 3; ++n)
            {
                scalar sum = 0.0;
                for (int m = 0; m < 3; ++m)
                {
                    sum += 2.0 *eps(m, j, n) * OmegaRot[m].value(); // OmegaRot is a vector, so we can access its components directly
                }
                skewOmegaRot.component(3*j+n) = sum;
            }
        }

        volTensorField OmegaTotal = Omega + skewOmegaRot;





        volScalarField S2 = 2.0 * magSqr(S);
        volScalarField Omega2 = 2.0 * magSqr(OmegaTotal);
        volScalarField Omegamag = sqrt(Omega2 + SMALL);

        volScalarField D2 = max(S2, 0.09 * tefomega2);
        volScalarField Dtilda = pow(sqrt(D2 + SMALL), 3)*Omegamag;

        volScalarField rStar = sqrt(S2 + SMALL) / (sqrt(Omega2 + SMALL));


        volSymmTensorField DSDt = fvc::ddt(S)+fvc::div(phi, S); // φ = U



        
        volTensorField rTilda =OmegaTotal*0.0;
       



        forAll(rTilda, celli)
        {
            tensor rt = tensor::zero;

            for (int i = 0; i < 3; ++i)
            {
                for (int k = 0; k < 3; ++k)
                {  
                    for (int j = 0; j < 3; ++j)
                    {
                        scalar sum = 0.0;

                        for (int m = 0; m < 3; ++m)
                        {
                            for (int n = 0; n < 3; ++n)
                            {
                                scalar e_imn = eps(i, m, n); // Levi-Civita
                                scalar e_jmn = eps(j, m, n);

                                sum += OmegaRot[m].value() * (e_imn * S[celli].component(3*j+n) + e_jmn * S[celli].component(3*i+n));
                            }
                        }

                        // Multiply by 2 * Omega_l * S_jk * DSDt_ij
                        scalar val = 2.0 * OmegaTotal[celli].component(3*i+k)* S[celli].component(3*j+k)*(sum + DSDt[celli].component(3*i+j))/Dtilda[celli]; // assume D~1 constant
                        rt.component(3*i+j) = val;
                    }
                }
            }

            rTilda[celli] = rt;
        }
        volScalarField rTildamag = sqrt(magSqr(rTilda) + SMALL);
        scalar cr1 = 1.0;
        scalar cr2 = 2.0;
        scalar cr3 = 1.0;
        scalar C_curv = 1.0;



        volScalarField frotation = (1.0 + cr1)
                         * (2.0 * rStar / (1.0 + rStar))
                         * (1.0 - cr3 * atan(cr2 * rTildamag))
                         - cr1;
        volScalarField fr1 = max(min(frotation, scalar(1.25)), scalar(0.0));

        volScalarField fr2 = max(scalar(0.0), scalar(1.0)+ C_curv*(fr1-scalar(1.0)));

        volScalarField G = nut*(gradU && dev(twoSymm(gradU)));

        scalarField& kSource = eqn.source();

        kSource+= (fr2 - 1.0) * alpha()*rho()*G;
    #};

    codeSetValue
    #{
        
    #};

        // Dummy entry. Make dependent on above to trigger recompilation
    code
    #{
        $codeInclude
        $codeCorrect
        $codeAddSup
        $codeSetValue
    #};

}
*/
/* epsilonCurvatureCorrectionSource
{
    type            coded;
    active          yes;

    select           all;
    field            epsilon;

   // name            epsilonCurvatureCorrectionSource;

    codeInclude
    #{
        #include "fvm.H"
        #include <cmath>
    #};

    codeCorrect
    #{

    #};
    codeAddSup
    #{
        const volVectorField& U = mesh().lookupObject<volVectorField>("U");
        const volScalarField& nut = mesh().lookupObject<volScalarField>("nut");
        const volScalarField& k = mesh().lookupObject<volScalarField>("k");
        const volScalarField& epsilon = mesh().lookupObject<volScalarField>("epsilon");

        const scalar Ceps1 = 1.44;

        volTensorField gradU = fvc::grad(U);
        volSymmTensorField S = symm(gradU);
        volTensorField Omega = 0.5 * (gradU - gradU.T());

        volScalarField S2 = 2.0 * magSqr(S);
        volScalarField Omega2 = 2.0 * magSqr(Omega);
        volScalarField rStar = sqrt(S2 + SMALL) / (sqrt(Omega2 + SMALL));

        volScalarField frotation = (1.0 + 2.0 * rStar / (1.0 + rStar)) * (1.0 - atan(2.0 * 0.0)) - 1.0;
        volScalarField fr1 = min(max(frotation, scalar(0.0)), scalar(1.25));

        volScalarField approxPk = nut * S2;

        scalarField& epsilonSource = eqn.source();

        epsilonSource+= (fr1 - 1.0) * Ceps1 * (epsilon / (k + SMALL)) * approxPk;
    #};
    codeSetValue
    #{
        
    #};

    // Dummy entry. Make dependent on above to trigger recompilation
    code
    #{
    $codeInclude
    $codeCorrect
    $codeAddSup
    $codeSetValue
    #};

}  */

}

// ************************************************************************* //
